# SQL Practice

Let's practice SQL through answering questions in this notebook

## SQLite and Initial Setup

Relational databases generally have two components:

1. **Database Server/Engine**: A software package that manages databases and runs in the background, listening for SQL queries from authorized users E.g. MySQL server, Microsoft SQL server, Postgres etc.
2. **Database Client**: A command-line tool or graphical user interface (GUI) to connect to the database server and run SQL queries. E.g. MySQL workbench, PgAdmin etc.

The server and client can be on the same computer e.g. both on your laptop, or on different computers e.g. the database server can be running on the cloud and you can connect to it using a client installed on your computer.

Most database servers/engines are designed to operate on databases containing large amounts of data (e.g. 100s of GBs) and to handle a very high volume of queries (e.g. thousands of queries per second). They typically require powerful hardware i.e. multi-core CPUs and large amounts of RAM.


<img src="https://www.sqlite.org/images/sqlite370_banner.gif" width="240" style="margin-left:0">

In this notebook, however, we'll use a lightweight database engine called [SQLite](https://www.sqlite.org/index.html), which is well-suited for databases with small amounts of data and has very limited CPU & RAM requirements. Despite being limited in its capabilities, it is the [most widely used database engine in the world](https://www.sqlite.org/mostdeployed.html). SQLite is used by smartphone apps, web browsers, desktop applications, IoT devices etc. to store and manage data locally on the device. 

If you're running this notebook locally, you'll need to [download and install `sqlite3`](https://www.servermania.com/kb/articles/install-sqlite/) on your computer. `sqlite3` is already installed on Binder. You can verify that you have `sqlite3` installed by running the following command to show the version of SQLite you have installed:

In [1]:
!sqlite3 --version

3.36.0 2021-06-18 18:36:39 5c9a6c06871cb9fe42814af9c039eb6da5427a6ec28f187af7ebfb62eafa66e5

Unlike other relational databases, SQLite doesn't have separate server and client packages. The `sqlite3` command line tool is all your need to create and interact with SQLite databases. The databases themselves are stored as files with the extension `.sqlite`. You can perform CRUD operations on the database simply by passing SQL queries using `sqlite3`.

Here's a visual representation of how SQLite differs from other relational database servers ([source](https://devopedia.org/sqlite)):

<img src="https://i.imgur.com/eC5Ieni.png" width="640">


Note that a `.sqlite` file is different from a `.sql` file, which contains commands for creating tables and inserting data. The `.sqlite` file is the actual database where the data is stored in a binary tabular format for efficient querying and manipulation.

In this notebook, we'll use the [Chinook open source database](https://github.com/lerocha/chinook-database). Let's begin by downloading the `.sqlite` file for the database containing all the required tables and the sample data.

In [2]:
from urllib.request import urlretrieve

In [3]:
db_url = 'https://github.com/lerocha/chinook-database/raw/master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite'

In [4]:
urlretrieve(db_url, 'chinook.sqlite')

('chinook.sqlite', <http.client.HTTPMessage at 0x7f91c8058a00>)

The database `chinook.sqlite` is now downloaded. To access and interact with the database by writing SQL queries directly within Jupyter, we'll use the [`ipython-sql`](https://pypi.org/project/ipython-sql/) library that provides the `%%sql` magic commands. It uses the [`sqlalchemy`](https://sqlalchemy.org) library behind the scenes to interact with the database.

In [5]:
!pip install ipython-sql --quiet --upgrade

In [6]:
!pip install sqlalchemy --quiet

In [7]:
%load_ext sql

We can now connect to the database using a [SQLAlchemy connection string](https://docs.sqlalchemy.org/en/14/core/engines.html). We'll use the `%%sql` Jupyter magic command.

In [10]:
%%sql 

sqlite:///chinook.sqlite

We are now connected to the database and we can start writing SQL queries.

## Chinook Database Structure and Queries

The Chinook database represents a digital media store, including tables for artists, albums, media tracks, invoices and customers. Here's an [Entity Relationship Diagram](https://www.guru99.com/er-diagram-tutorial-dbms.html) (ERD) showing the structure of the Chinook database:

![](https://i.imgur.com/X1wM142.png)

Let's begin by looking at the data from some of the tables in the database. We can write SQL queries directly within Jupyter code cells by including the magic command `%%sql` as the first line of the cell, indicating that contents of cell represent a SQL query.

In [11]:
%%sql 

SELECT * 
FROM Artist 
LIMIT 5;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains')]

In [12]:
%%sql 

SELECT * 
FROM Album 
LIMIT 5;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

## Selection and Ordering

> **QUESTION 1**: Write a SQL query to sort the rows from the table `Track` in alphabetical order of Track name and display the first 10 rows.

In [14]:
%%sql

SELECT *
FROM Track
ORDER BY Name
LIMIT 10;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(3027, '"40"', 239, 1, 1, 'U2', 157962, 5251767, 0.99),
 (2918, '"?"', 231, 3, 19, None, 2782333, 528227089, 1.99),
 (3412, '"Eine Kleine Nachtmusik" Serenade In G, K. 525: I. Allegro', 281, 2, 24, 'Wolfgang Amadeus Mozart', 348971, 5760129, 0.99),
 (109, '#1 Zero', 11, 1, 4, 'Cornell, Commerford, Morello, Wilk', 299102, 9731988, 0.99),
 (3254, '#9 Dream', 255, 2, 9, None, 278312, 4506425, 0.99),
 (602, "'Round Midnight", 48, 1, 2, 'Miles Davis', 357459, 11590284, 0.99),
 (1833, '(Anesthesia) Pulling Teeth', 150, 1, 3, 'Cliff Burton', 254955, 8234710, 0.99),
 (570, '(Da Le) Yaleo', 46, 1, 1, 'Santana', 353488, 11769507, 0.99),
 (3045, "(I Can't Help) Falling In Love With You", 241, 1, 8, None, 207568, 6905623, 0.99),
 (3057, '(Oh) Pretty Woman', 242, 1, 1, 'Bill Dees/Roy Orbison', 174680, 5665828, 0.99)]

In [19]:
ans1 = _
# print(ans1)

> **QUESTION 1.1**: Write a SQL query to show the _next 10_ rows based on the above criteria.

In [25]:
%%sql

SELECT *
FROM Track
ORDER BY Name
LIMIT 10, 10;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(3471, '(There Is) No Greater Love (Teo Licks)', 322, 2, 9, 'Isham Jones & Marty Symes', 167933, 2773507, 0.99),
 (1947, '(We Are) The Road Crew', 160, 1, 3, 'Clarke/Kilmister/Taylor', 192600, 6283035, 0.99),
 (2595, '(White Man) In Hammersmith Palais', 211, 1, 4, 'Joe Strummer/Mick Jones', 240640, 7883532, 0.99),
 (709, '(Wish I Could) Hideaway', 55, 1, 1, 'J.C. Fogerty', 228466, 7432978, 0.99),
 (2869, '...And Found', 231, 3, 19, None, 2563833, 500330548, 1.99),
 (1894, '...And Justice For All', 156, 1, 3, 'James Hetfield, Lars Ulrich & Kirk Hammett', 585769, 19262088, 0.99),
 (2906, '...In Translation', 230, 3, 19, None, 2604575, 215441983, 1.99),
 (3166, '.07%', 228, 3, 21, None, 2585794, 541715199, 1.99),
 (1268, '01 - Prowler', 100, 1, 6, 'Steve Harris', 236173, 5668992, 0.99),
 (1269, '02 - Sanctuary', 100, 1, 6, "David Murray/Paul Di'Anno/Steve Harris", 196284, 4712576, 0.99)]

> **QUESTION 1.2:** Write some SQL queries in the cells below to explore the first few rows of each table in the database.

In [31]:
from sqlalchemy import create_engine
engine = create_engine("sqlite:///chinook.sqlite")

In [103]:
from sqlalchemy import inspect
inspector = inspect(engine)

for i, table_name in enumerate(inspector.get_table_names()):
    print(table_name)  
print("\nTotal tables in the database:", i+1)

Album
Artist
Customer
Employee
Genre
Invoice
InvoiceLine
MediaType
Playlist
PlaylistTrack
Track

Total tables in the database: 11

## Counting

> **QUESTION 2**: Write a SQL query to calculate the total number of employees working at Chinook.

In [58]:
%%sql

SELECT COUNT(DISTINCT FirstName) AS total_employees
FROM Employee;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(8,)]

In [59]:
ans2 = _
print(ans2)

+-----------------+
| total_employees |
+-----------------+
|        8        |
+-----------------+

> **QUESTION 2.1**: Write SQL queries to calculate the total number of customers, total number of artists and total number of tracks in the database.

In [99]:
%%sql
SELECT COUNT(DISTINCT CustomerID) AS Total_customers
FROM Customer;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(59,)]

In [100]:
%%sql
SELECT COUNT(DISTINCT ArtistID) AS Total_artists
FROM Artist;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(275,)]

In [101]:
%%sql
SELECT COUNT(DISTINCT TrackID) AS Total_tracks
FROM Track;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(3503,)]

## Aggregation and Grouping

> **QUESTION 3**: Write a SQL query to show the top 10 albums with the highest number of tracks. The result should contain 2 columns: album ID and number of tracks in the album (name the column "Tracks"). Here are the first few rows of the result:
> <img src="https://i.imgur.com/0vGhVMZ.png" width="120">

In [77]:
%%sql

SELECT AlbumId, COUNT(DISTINCT TrackId) AS Tracks
FROM track
GROUP BY AlbumId
ORDER BY Tracks DESC
LIMIT 10;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(141, 57),
 (23, 34),
 (73, 30),
 (229, 26),
 (230, 25),
 (251, 25),
 (83, 24),
 (231, 24),
 (253, 24),
 (24, 23)]

In [78]:
ans3 = _

> **QUESTION 3.1**: Improve the above query to also show the album name, artist ID and artist name.

In [106]:
%%sql

SELECT t.AlbumId, t.Name, al.ArtistId, ar.Name AS Artist, COUNT(DISTINCT t.TrackId) AS Tracks
FROM Track AS t
JOIN Album AS al
ON t.AlbumId = al.AlbumId
JOIN Artist AS ar
ON al.ArtistId = ar.ArtistId
GROUP BY t.AlbumId
ORDER BY Tracks DESC
LIMIT 10;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(141, 'Are You Gonna Go My Way', 100, 'Lenny Kravitz', 57),
 (23, 'Carolina', 17, 'Chico Buarque', 34),
 (73, 'Signe', 81, 'Eric Clapton', 30),
 (229, 'A Tale of Two Cities', 149, 'Lost', 26),
 (230, 'Lost (Pilot, Part 1) [Premiere]', 149, 'Lost', 25),
 (251, 'Gay Witch Hunt', 156, 'The Office', 25),
 (83, 'My Way', 85, 'Frank Sinatra', 24),
 (231, 'Man of Science, Man of Faith (Premiere)', 149, 'Lost', 24),
 (253, 'Battlestar Galactica, Pt. 1', 158, 'Battlestar Galactica (Classic)', 24),
 (24, 'Mateus Enter', 18, 'Chico Science & Nação Zumbi', 23)]

> **QUESTION 3.2**: List the top 10 artists with the highest number of tracks.

In [113]:
%%sql

SELECT al.ArtistId, ar.Name AS Artist, COUNT(DISTINCT t.TrackId) AS Tracks
FROM Track AS t
JOIN Album AS al
ON t.AlbumId = al.AlbumId
JOIN Artist AS ar
ON al.ArtistId = ar.ArtistId
GROUP BY ar.ArtistId
ORDER BY Tracks DESC
LIMIT 10;

   sqlite://
 * sqlite:///chinook.sqlite
Done.

[(90, 'Iron Maiden', 213),
 (150, 'U2', 135),
 (22, 'Led Zeppelin', 114),
 (50, 'Metallica', 112),
 (149, 'Lost', 92),
 (58, 'Deep Purple', 92),
 (118, 'Pearl Jam', 67),
 (100, 'Lenny Kravitz', 57),
 (21, 'Various Artists', 56),
 (156, 'The Office', 53)]

## Functions and Joins

> **QUESTION 4**: Show a list of the top 10 customer with the highest total spend in 2012. Calculate the total amount spent by each customer by adding the totals from all their invoices in the year 2012. Order the list by the invoice total (decreasing order). The result should contain the rows CustomerId, FirstName, LastName and TotalSpend. Here are the first few rows of the result:
> <img src="https://i.imgur.com/rayPKc3.png" width="480">
>
>
> *Note*: SQLite doesn't support the `YEAR` function. Instead use `strftime("%Y", Invoice.InvoiceDate)` to extract the year from the column `InvoiceDate` as a string. [Learn more.](https://www.w3resource.com/sqlite/sqlite-strftime.php)
>
> _Hint_: First try to write down a step-by-step solution to the problem in plain English, and then try to convert it to a SQL query. Use the empty cells below to experiment with intermediate queries.

In [ ]:
%%sql

???

In [ ]:
# DON'T MODIFY OR MOVE THIS CELL! IT IS USED FOR EVALUATION.
ans4 = _

Let's save our work before continuing.

In [ ]:
jovian.commit()

## Joins and Arithmetic Operations

> **QUESTION 5**: Write a SQL query to show the total number of albums and the average number of tracks per album for every artist. The result should include the artist ID, artist's name, total albums (name the column "Albums") and average tracks per album (name the column "TracksPerAlbum"). Sort the results in alphabetical order of artist name. Here are the first few rows of the result:
>
> <img src="https://i.imgur.com/WAE7oOx.png" width="640">
> 
> *Hint*: While dividing two integers, multiply one of the numbers by 1.0 to convert them into floats. [Learn more.](https://stackoverflow.com/questions/8305613/converting-int-to-real-in-sqlite)

In [ ]:
%%sql

???

In [ ]:
# DON'T MODIFY OR MOVE THIS CELL! IT IS USED FOR EVALUATION.
ans5 = _

Let's save our work before continuing.

In [ ]:
jovian.commit()

(OPTIONAL) Write a SQL query to display the top 10 highest grossing tracks in 2012. The result should contain the track ID, track name, number of units sold, and the total revenue from the track in 2012. *Hint*: Use the `InvoiceLine` table.

Let's save our work before continuing.

In [ ]:
jovian.commit()

## Joining Multiple Tables

> **QUESTION 6:** Show the following information for all the tracks by the Artist "Metallica": Track ID, Track Name, Album Title, Artist Name, Composer, Media Type, Genre and track length in milliseconds. Order the tracks in alphabetical order of album names.
> 
> Here are the first few rows of the expected result:
>
> <img src="https://i.imgur.com/Ovhm9Nh.png" width="640">

In [ ]:
%%sql

???

In [ ]:
# DON'T MODIFY OR MOVE THIS CELL! IT IS USED FOR EVALUATION.
ans6 = _

(OPTIONAL) Modify the above query to show the length of each track in the "MM:SS" format i.e. "03:15". Enter the updated query in the empty cell below.

(OPTIONAL) Modify the above query to include the total revenue from the sales of each track. Enter the updated query in the empty cell below.

Let's save our work before continuing.

In [ ]:
jovian.commit()

## Table Creation  and Foreign Keys

> **QUESTION 7**: Create a new table `HallOfFame` to track the list of artists who have been added into the Chinook Hall of Fame. The table should contain three columns: 
>
> 1. `HallOfFameId` (int): Primary key with [Auto Increment](https://www.sqlite.org/autoinc.html)
> 2. `ArtistId` (int): Foreign key (from the Artist table)
> 3. `YearAdded` (int): The year the artist was added to the hall of fame 
>
> Once created, add 5 entries to the table (any artists of your choice).

In [ ]:
%%sql

???

In [ ]:
%%sql

???

Once the table is created and records have been inserted, you can view the list of artists in the hall of fame using the following query.

In [ ]:
%%sql

SELECT * FROM HallOfFame JOIN Artist ON HallOfFame.ArtistId=Artist.ArtistId

In [ ]:
# DON'T MODIFY OR MOVE THIS CELL! IT IS USED FOR EVALUATION.
ans7 = _

Let's save our work before continuing.

In [ ]:
jovian.commit()

## Inserting Data into Tables

> **QUESTION 8**: Write SQL queries to insert the following records into the database:
> 
> 1. A new artist called "Linkin Park"
> 2. Two new albums for the artist Linkin Park:
>     1. Hybrid Theory
>     2. Meteora
> 3. Six new tracks (come up with sensible values for columns like Composer, Milliseconds etc.):
>     1. Papercut (in the album Hybrid Theory)
>     2. In The End (in the album Hybrid Theory)
>     3. Crawling (in the album Hybrid Theory)
>     4. Somewhere I Belong (in the album Meteora)
>     5. Numb (in the album Meteora)
>     6. Breaking the Habit (in the album Meteora)
>
> *Hint*: You need not provide a value for the ID (primary key) columns while inserting these rows, because the ID columns are marked as [AUTO INCREMENT](https://www.sqlite.org/autoinc.html) and will automatically be assigned the next available numeric value.

Here's the query to insert a new artist:

In [ ]:
%%sql

INSERT INTO Artist (Name) VALUES ("Linkin Park")

Write the query to insert the new albums below:

In [ ]:
%%sql

???

Write the query to insert the new tracks below:

In [ ]:
%%sql

???

Make sure to insert exactly one copy of each of the above records. If you've inserted multiple copies, delete the extra rows before submitting.

If the records were inserted properly, you should be able to retrieve them back using the following queries.

In [ ]:
%%sql

SELECT * FROM Artist WHERE Name="Linkin Park"

In [ ]:
# DON'T MODIFY OR MOVE THIS CELL! IT IS USED FOR EVALUATION.
ans8a = _

In [ ]:
%%sql

SELECT * FROM Album JOIN Artist on Album.ArtistId=Artist.ArtistId WHERE Artist.Name="Linkin Park"

In [ ]:
# DON'T MODIFY OR MOVE THIS CELL! IT IS USED FOR EVALUATION.
ans8b = _

In [ ]:
%%sql

SELECT * 
    FROM Track JOIN Album
    ON Track.AlbumId=Album.AlbumId
    JOIN Artist
    ON Album.ArtistId=Artist.ArtistId 
    WHERE Artist.Name="Linkin Park"

In [ ]:
# DON'T MODIFY OR MOVE THIS CELL! IT IS USED FOR EVALUATION.
ans8c = _

Let's save our work before continuing. Press `cntrl/cmd + s` to save your work.

## LeetCode Problems

### Question 9

[Problem 171](https://leetcode.com/problems/excel-sheet-column-number/) - Excel Sheet Column Number
Given a string `columnTitle` that represents the column title as appears in an Excel sheet, return its corresponding column number.

For example:
```
A -> 1
B -> 2
C -> 3
...
Z -> 26
AA -> 27
AB -> 28 
...
```
Example 1:
```
Input: columnTitle = "A"
Output: 1
```
Example 2:
```
Input: columnTitle = "AB"
Output: 28
Example 3:

Input: columnTitle = "ZY"
Output: 701
```
Constraints:
```
1 <= columnTitle.length <= 7
columnTitle consists only of uppercase English letters.
columnTitle is in the range ["A", "FXSHRXW"].
```

In [1]:
def titleToNumber(columnTitle):
    ???

In [ ]:
# This should return "True"
titleToNumber("A") == 1

In [ ]:
# This should return "True"
titleToNumber("AB") == 28

In [ ]:
# This should return "True"
titleToNumber("ZY") == 701

### Question 10

[Problem 859](https://leetcode.com/problems/buddy-strings/) - Buddy Strings

Given two strings `s` and `goal`, return `true` if you can swap two letters in `s` so the result is equal to `goal`, otherwise, return `false`.

Swapping letters is defined as taking two indices `i` and `j` (0-indexed) such that `i != j` and swapping the characters at `s[i]` and `s[j]`.

For example, swapping at indices `0` and `2` in `"abcd"` results in `"cbad"`.
 

Example 1:
```
Input: s = "ab", goal = "ba"
Output: true
Explanation: You can swap s[0] = 'a' and s[1] = 'b' to get "ba", which is equal to goal.
```
Example 2:
```
Input: s = "ab", goal = "ab"
Output: false
Explanation: The only letters you can swap are s[0] = 'a' and s[1] = 'b', which results in "ba" != goal.
```
Example 3:
```
Input: s = "aa", goal = "aa"
Output: true
Explanation: You can swap s[0] = 'a' and s[1] = 'a' to get "aa", which is equal to goal.
```

Constraints:
```
1 <= s.length, goal.length <= 2 * 104
s and goal consist of lowercase letters.
```

In [2]:
def buddyStrings(s, goal):
    ???

In [ ]:
# This should return "True"
buddyStrings("ab","ba") == True

In [ ]:
# This should return "True"
buddyStrings("ab","ab") == False

In [ ]:
# This should return "True"
buddyStrings("aa","aa") == True

## Make a Submission

To make a submission, you can submit your Jovian notebook link on the assignment 'submit' page.

You can make any number of submissions. Only your final submission will be considered for grading.

Here are some more optional questions you can try solving: https://github.com/LucasMcL/15-sql_queries_02-chinook